Connecting to 127.0.0.1 port 1225 ... connected
??? 220
<<< 220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
>>> EHLO test.ex
??? 250-
<<< 250-myhost.test.ex Hello test.ex [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-STARTTLS
<<< 250-STARTTLS
??? 250 HELP
<<< 250 HELP
>>> STARTTLS
??? 220
<<< 220 TLS go ahead
Attempting to start TLS
SSL connection using ke-RSA-AES256-SHAnnn
Succeeded in starting TLS
>>> EHLO test.ex
??? 250-
<<< 250-myhost.test.ex Hello test.ex [127.0.0.1]
??? 250-SIZE
<<< 250-SIZE 52428800
??? 250-8BITMIME
<<< 250-8BITMIME
??? 250-PIPELINING
<<< 250-PIPELINING
??? 250-REQUIRETLS
<<< 250-REQUIRETLS
??? 250 HELP
<<< 250 HELP
>>> MAIL FROM:<a@test.ex> REQUIRETLS
??? 250
<<< 250 OK
>>> RCPT TO:<dump@test.ex>
??? 250
<<< 250 Accepted
>>> DATA
??? 354
<<< 354 Enter message, ending with "." on a line by itself
>>> Subject: foo
>>> 
>>> content
>>> .
??? 250
<<< 250 OK id=10HmaX-0005vi-00
>>> QUIT
??? 221
<<< 221 myhost.test.ex closing connection
End of script
220 myhost.test.ex ESMTP Exim x.yz Tue, 2 Mar 1999 09:44:33 +0000
250 OK
250 Accepted
354 Enter message, ending with "." on a line by itself
250 OK id=10HmaZ-0005vi-00
221 myhost.test.ex closing connection
